-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: mysql7.serv00.com
-- Generation Time: Apr 07, 2025 at 01:21 AM
-- Server version: 8.0.39
-- PHP Version: 8.1.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `m3896_bap`
--

-- --------------------------------------------------------

--
-- Table structure for table `log`
--

CREATE TABLE `log` (
  `nama` varchar(255) NOT NULL,
  `status` varchar(10) NOT NULL,
  `timestamp` timestamp NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Dumping data for table `log`
--

INSERT INTO `log` (`nama`, `status`, `timestamp`) VALUES
('Qolbiatusshani syalwa mashuri', 'Berhasil', '2025-04-01 01:34:52'),
('CobA', 'Berhasil', '2025-04-01 02:45:33'),
('Qolbiatusshani syalwa mashuri', 'Berhasil', '2025-04-02 03:39:53'),
('Kayyisa', 'Berhasil', '2025-04-02 03:57:00'),
('Admin', 'Berhasil', '2025-04-02 06:27:01'),
('Cooba', 'Berhasil', '2025-04-02 07:39:19'),
('Qolbiatusshani syalwa mashuri', 'Berhasil', '2025-04-02 13:53:09'),
('Admin', 'Berhasil', '2025-04-03 07:40:41'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 11:26:10'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 11:28:13'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 11:36:31'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 11:39:13'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 11:41:17'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:07:37'),
('madjinal@gmail.com ', 'Gagal', '2025-04-03 12:09:40'),
('madjinal@gmail.com ', 'Gagal', '2025-04-03 12:09:43'),
('madjinal@gmail.com ', 'Gagal', '2025-04-03 12:09:46'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:10:50'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:12:48'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:14:37'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:16:35'),
('Ardanti Azahra Salsabilla ', 'Berhasil', '2025-04-03 12:21:10'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:58:44'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:59:34'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-03 12:59:41'),
('Ardanti Azahra Salsabilla ', 'Berhasil', '2025-04-03 18:02:42'),
('Qolbiatusshani syalwa mashuri', 'Berhasil', '2025-04-04 17:18:58'),
('Nafisa Anggi Celomitha', 'Berhasil', '2025-04-04 17:32:28'),
('Shofi Nur Izzati', 'Berhasil', '2025-04-04 17:42:18'),
('Daffa\\\' Nada Azizah', 'Berhasil', '2025-04-04 17:42:56'),
('SHOFI NUR IZZATI', 'Berhasil', '2025-04-04 17:46:36'),
('SHOFI NUR IZZATI', 'Berhasil', '2025-04-04 18:10:55'),
('Yunifa Nella khoirunnisa', 'Berhasil', '2025-04-04 18:14:43'),
('Yunifa Nella khoirunnisa ', 'Berhasil', '2025-04-04 18:15:45'),
('Nasywa fawwaziyah', 'Berhasil', '2025-04-04 18:16:10'),
('yunifaanisa625@gmail.com', 'Gagal', '2025-04-04 18:18:26'),
('yunifa Nella khoirunnisa ', 'Berhasil', '2025-04-04 18:18:33'),
('Nasywa fawwaziyah', 'Berhasil', '2025-04-04 18:20:13'),
('Yunifa Nella khoirunnisa ', 'Berhasil', '2025-04-04 18:24:36'),
('Yunifa Nella khoirunnisa ', 'Berhasil', '2025-04-04 18:31:07'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:36:32'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:36:49'),
('cobaa', 'Berhasil', '2025-04-04 18:38:10'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:39:48'),
('coba', 'Berhasil', '2025-04-04 18:40:34'),
('cobaa', 'Berhasil', '2025-04-04 18:41:25'),
('cooba', 'Berhasil', '2025-04-04 18:42:50'),
('cobba', 'Berhasil', '2025-04-04 18:47:35'),
('coobbba', 'Berhasil', '2025-04-04 18:48:24'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:49:27'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:49:57'),
('AlKhansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:50:04'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:51:28'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:51:58'),
('Al Khansa Minnahussaniyyah', 'Berhasil', '2025-04-04 18:52:15'),
('Kayyisa', 'Berhasil', '2025-04-05 03:33:58'),
('Kayyisa', 'Berhasil', '2025-04-05 03:39:18'),
('Alifa Nur \\\'Azaza', 'Berhasil', '2025-04-05 04:20:37'),
('Alifa Nur \\\'Azaza', 'Berhasil', '2025-04-05 05:30:20'),
('NAFISA ANGGI CELOMITHA', 'Berhasil', '2025-04-05 05:56:45'),
('coba', 'Berhasil', '2025-04-06 05:38:22'),
('Shofi Nur Izzati', 'Berhasil', '2025-04-06 05:58:32'),
('Coba', 'Berhasil', '2025-04-06 09:33:12'),
('SHOFI NUR IZZATI', 'Berhasil', '2025-04-06 12:10:59'),
('Coba', 'Berhasil', '2025-04-06 13:52:03'),
('Ardanti Azahra Salsabilla ', 'Berhasil', '2025-04-06 13:59:35'),
('Qolbiatusshani syalwa mashuri', 'Berhasil', '2025-04-06 14:07:25'),
('Nafisa Anggi Celomitha ', 'Berhasil', '2025-04-06 14:16:20'),
('Syifa azzahra putri', 'Berhasil', '2025-04-06 14:46:09'),
('Yunifa Nella khoirunnisa ', 'Berhasil', '2025-04-06 14:48:39'),
('Qolbiatusshani syalwa mashuri', 'Berhasil', '2025-04-06 15:04:39'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-06 16:31:53'),
('Al Khansa Minnahussaniyyah ', 'Berhasil', '2025-04-06 16:32:36'),
('Kayyisa ', 'Berhasil', '2025-04-06 16:53:42'),
('Nasywa fawwaziyah', 'Berhasil', '2025-04-06 17:16:43'),
('Syifa azzahra putri', 'Berhasil', '2025-04-06 17:28:10'),
('SHOFI NUR IZZATI', 'Berhasil', '2025-04-06 21:12:39'),
('SHOFI NUR IZZATI', 'Berhasil', '2025-04-07 02:57:39');

-- --------------------------------------------------------

--
-- Table structure for table `nilai`
--

CREATE TABLE `nilai` (
  `id` int NOT NULL,
  `id_user` int NOT NULL,
  `id_ujian` int NOT NULL,
  `jawaban` text COLLATE utf8mb4_general_ci NOT NULL,
  `waktu` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `status` varchar(25) COLLATE utf8mb4_general_ci NOT NULL,
  `nilai` varchar(10) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `nilai`
--

INSERT INTO `nilai` (`id`, `id_user`, `id_ujian`, `jawaban`, `waktu`, `status`, `nilai`) VALUES
(6, 3, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(7, 3, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(8, 4, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(9, 5, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(10, 6, 8, '3,0,0,0,2,4,2,3,2,2,1,4,3,1,2,4,1,2,3,4,0,0,0,1,1,3,4,4,1,4,2,1,1,0,3,0,0,3,4,1,0,0,1,1,4,3,0,3,4,1', '3929', 'selesai', '42/50'),
(11, 7, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(12, 8, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(13, 9, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(14, 10, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(15, 11, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(16, 12, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(17, 13, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(18, 14, 8, '3,0,0,0,2,4,1,0,3,2,1,4,3,1,2,3,4,2,0,4,3,0,0,1,1,3,0,4,1,4,2,3,1,0,1,0,0,3,4,3,0,1,1,1,0,2,2,1,1,1', '3348', 'selesai', '33/50'),
(19, 15, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(20, 16, 8, '3,0,0,0,4,4,2,3,1,2,1,4,3,1,3,3,1,2,0,4,0,0,0,1,0,3,0,4,1,4,2,4,0,0,3,2,0,4,2,3,0,1,1,2,4,3,4,4,2,1', '690', '', ''),
(21, 17, 8, '0,0,0,0,2,3,2,3,2,2,1,4,3,1,3,4,0,2,0,4,0,0,0,1,4,3,1,4,1,4,1,4,1,2,1,2,0,0,0,0,1,1,1,0,1,2,0,1,0,1', '4258', 'selesai', '29/50'),
(22, 18, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(23, 19, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(24, 20, 8, '4,0,2,3,4,4,1,3,2,2,1,4,2,1,2,4,1,2,1,4,2,2,0,1,0,3,0,4,1,4,2,1,2,2,3,1,0,1,3,3,0,2,1,2,4,1,0,3,2,1', '4627', 'selesai', '30/50'),
(25, 21, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(26, 22, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(27, 23, 8, '4,0,0,0,2,4,1,3,2,2,1,4,3,1,2,4,1,2,3,4,0,0,0,1,1,3,1,4,1,4,2,1,2,0,1,0,0,0,2,3,0,1,1,2,4,1,4,3,2,1', '4578', 'selesai', '41/50'),
(28, 4, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(29, 5, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(30, 6, 11, '3,1,2,0,4,3,4,1,3,3,3,2,3,4,2,2,4,0,2,0,0,4,1,4,2,3,0,1,4,0,3,1,2,2,4,2,2,3,3,3', '4460', 'selesai', '39/40'),
(31, 7, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(32, 8, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(33, 9, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(34, 10, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(35, 11, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(36, 12, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(37, 13, 11, '3,3,2,0,4,3,4,1,1,2,1,2,3,4,2,2,4,0,2,0,0,0,2,4,2,3,0,1,0,0,3,0,2,2,4,2,4,3,0,0', '3771', 'selesai', '29/40'),
(38, 14, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(39, 15, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(40, 16, 11, '3,3,2,4,4,3,4,3,0,2,3,1,4,4,2,2,4,0,2,0,0,1,1,4,0,1,0,1,0,0,3,3,2,0,4,2,2,1,1,1', '289', 'selesai', '25/40'),
(41, 17, 11, '3,3,2,0,4,3,4,3,1,2,3,0,0,4,2,2,4,0,0,0,0,0,3,2,2,3,0,1,4,0,3,1,2,2,4,2,1,3,2,0', '3833', 'selesai', '27/40'),
(42, 18, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(43, 19, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(44, 20, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(45, 21, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(46, 22, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5400', '', ''),
(47, 23, 11, '3,3,2,0,4,3,1,1,1,3,3,1,3,4,2,2,4,0,2,0,0,4,1,3,2,3,0,1,4,0,3,1,2,2,4,2,1,4,3,4', '4357', 'selesai', '32/40'),
(48, 2, 8, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5352', 'selesai', '0/50'),
(49, 2, 11, '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1', '5367', 'selesai', '0/40');

-- --------------------------------------------------------

--
-- Table structure for table `soal`
--

CREATE TABLE `soal` (
  `id` int NOT NULL,
  `id_ujian` int NOT NULL,
  `soal` text COLLATE utf8mb4_general_ci NOT NULL,
  `a` text COLLATE utf8mb4_general_ci NOT NULL,
  `b` text COLLATE utf8mb4_general_ci NOT NULL,
  `c` text COLLATE utf8mb4_general_ci NOT NULL,
  `d` text COLLATE utf8mb4_general_ci NOT NULL,
  `e` text COLLATE utf8mb4_general_ci NOT NULL,
  `kunci` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `soal`
--

INSERT INTO `soal` (`id`, `id_ujian`, `soal`, `a`, `b`, `c`, `d`, `e`, `kunci`) VALUES
(15, 1, 'هذا عدنان ... طبيب', 'هو	\r\n', 'هي', 'أنت', 'أنا', '', 0),
(16, 1, '؟ اسمي فاطمة .....', 'ما اسمه', 'ما اسمها؟', 'ما اسمك', 'ما اسمكِ', '', 3),
(17, 1, 'هل .... تركي؟', 'أنا', 'هي', 'أنت', 'أنتِ', '', 2),
(18, 1, 'صديقتي هي مدرسة .... ', 'هذا', 'هذه', 'هل', 'أين', '', 1),
(19, 1, '... من اسم البلد', 'تركيا', 'سورية', 'باكستاني', 'مصرية', '', 0),
(20, 1, '... سوري هي', 'اسم البلد', 'الفعل', 'اسم الإستفهام', 'الجنسية', '', 3),
(21, 1, 'ما معنى التحية؟', 'perkenalan', 'pertemuan', 'penghormatan', 'profesi', '', 2),
(22, 1, '... من أين أنت؟ أنا من ', 'إندونيسية', 'ماليزيا', 'فلسطيني', 'باكستاني', '', 1),
(23, 1, '... سورية هي ', 'اسم البلد', 'الفعل', 'اسم الإستفهام', 'الجنسية', '', 3),
(26, 2, 'عادل ... القرآن الكريم', 'يصلي', 'ينتظر', 'يذهب', 'يقرأ', '', 3),
(27, 2, '؟ هذه صورة أبي أحمد هو معلم ......', 'من هذا؟', 'من هذه؟', 'ما هذا؟', 'ما هذه؟', '', 3),
(28, 2, 'عبد المطلب ... رسول الله صى الله عليه وسلم ', 'عمّ', 'أمّ', 'أبو', 'جدّ', '', 3),
(29, 2, 'آمنة... رسول الله صى الله عليه وسلم', 'عمّ', 'أمّ', 'أبو', 'جدّ', '', 1),
(30, 2, 'أين ابنة؟ ...... ابنة', 'هذا هو', 'هذا هي', 'هذه هو', 'هذه هي', '', 3),
(31, 2, 'أين زينب؟', 'زينب في الغرفة يقرأ القرآن', 'زينب في الحمام تقرأ القرآن', 'زينب في المصلى يصلي', 'زينب في المسجد تصلي', '', 3),
(32, 2, 'أي كلمة غريبة؟', 'حمام', 'صديق', 'غرفة', 'مسجد', '', 1),
(33, 2, 'فيما يلي أنواع المهنة إلّا...', 'ابن', 'مدرس', 'طبيب', 'طالب', '', 0),
(34, 2, 'هذه ... ندى هي طالبة جديدة في المدرسة', 'والدتي', 'جدي', 'ابنتي', 'أمّي', '', 2),
(35, 1, 'ما الفرق بين اسم البلد والجنسية؟', 'الجنسية لها ياء مشددة أما اسم البلد ليس له ياء مشددة', 'الجنسية ليست لها ياء مشددة أما اسم البلد له ياء مشددة', 'الجنسية لها ياء مشددة و أيضا اسم البلد له ياء مشددة', 'الجنسية ليست لها ياء مشددة و أيضا اسم البلد ليس له ياء مشددة', '', 0),
(36, 2, 'من صديقك؟', 'ليلى', 'ندى', 'معاذ', 'زينب', '', 2),
(38, 3, 'كم وجبة تاكلين في اليوم؟', '،اكل ثلاثة وجبة في اليوم \r\n', 'اكل ثلاثة وجبات في اليوم \r\n', 'اكل ثلاث وجبات في اليوم \r\n', 'اكل ثلاث وجبة في اليوم \r\n', '', 2),
(39, 3, 'ماذا تاكل في الغداء ', 'اكل الارز والسمك ', 'اكل الارز والسمكه ', 'اكل الارز والسمكه ', 'كله اجابه خطا', '', 1),
(40, 3, 'ماذا تطلب من الشراب', 'اكل اللحمه من فضلك ', 'اطلب اللحمه من فضلك ', 'اكل الفاكهه من فضلك ', 'كل اجابه خطا ', '', 2),
(41, 3, '.... اين الغداء؟ أنا ', 'شبعان ', 'غضبان ', 'جوعان ', 'عطشان ', '', 2),
(42, 3, 'اين الحليب ؟', 'الحليب على الماء ', 'الحليب على الكوب ', 'الحليب على القهوة', ' الحليب على المائدة ', '', 3),
(43, 3, 'Janganlah kamu pesan daging!', 'لا تأكل اللحم ', 'لا يأكل اللحم ', 'لا تطلب اللحم ', 'لا يطلب اللحم', '', 0),
(44, 3, 'وزني 100 كيل . انت .... جدا ', 'نخيف ', 'جيد ', 'سمين ', 'طويل', '', 2),
(45, 3, 'الترتيب لرقم ٧', 'السادسه ', 'السابعة', 'الثامنة', 'السبعة', '', 1),
(46, 4, '... أين تصلي', 'الصلوات الخمس؟ ', 'الصلوات الخميس؟ ', 'الصلوات الخامس؟ ', 'الخامس الصلوات؟', '', 0),
(47, 4, '!ضع ... بجانبك', 'المنبهُ', 'المنبهَ', 'المنبهِ ', 'المنبهْ', '', 1),
(48, 4, '... فيما يلي من الفعل المضارع إلا', 'يسافر', ' أصلي', ' أستيقظ', ' مسافر', '', 3),
(49, 4, '... فيما يلي من الفعل المضارع إلا', 'يسافر', ' أصلي', ' أستيقظ', ' مسافر', '', 3),
(50, 4, 'أ : أذهب الى المسجد الحرام\r\nب : لماذا؟', 'لأكل السمك', ' لأصلي في المدينة المنورة ', ' لأسافر الى بغداد ', 'لأصلي الجمعة', '', 3),
(51, 4, '!اختر الجملة الصحيحة', ' لماذا أنت أستيقظ؟', ' لماذا أنت مسافر؟', ' لماذا أنت يقرا؟ ', 'لماذا أنتَ مسافرة؟', '', 1),
(52, 4, 'أصلي ... في مسجد بلال', 'الفجرُ', 'الفجرَ', 'الفجرِ', 'الفجرْ', '', 1),
(53, 4, 'هل تستيقظ متأخرا؟', 'نعم أستيقظ متاخرا', ' نعم أستيقظ مبكرا', ' نعم تستيقظ مبكرا', ' لا, أستيقظ متأخرا', '', 0),
(54, 4, 'أين تصلي الجمعة؟', 'أصلي في المسجد النبوي', 'أقرا القران', 'نعم نصلي الجمعة', 'المسجد بعيد عن البيت', '', 0),
(55, 4, 'سيسافر أحمد الى...ليصلي الجمعة في المسجد الحرام', 'بغداد', 'سوريا', 'مصر ', 'مكة', '', 3),
(56, 4, ' ...الصلاة بعد صلاة الفجرهي', 'صلاة العشاء', 'صلاة المغرب', 'صلاة العصر', 'صلاة الظهر', '', 3),
(57, 5, '...لدينا شقة', 'جميلٌ', 'جميلًا', 'جميلةٌ', 'جميلةً', '', 2),
(58, 5, 'ما هذه؟', 'مرآة', 'فرن', 'سخان', 'أريكة', '', 3),
(59, 5, '...اليوم بعد يوم الإثنين هو', 'يوم الجمعة', 'يوم الخميس', 'يوم الأربعاء', 'يوم الثلاثاء', '', 3),
(60, 5, '...أين تسكن؟ أسكن في', 'حي الجامعة', 'حي المطار', 'المسجد', 'مكة', '', 1),
(61, 5, 'أ : ..... ؟\r\nب : الشقة في الدور الخامس', 'أين شقة؟', 'في أي الشقة؟', 'في أي دورٍ سقةٌ؟', 'في أي دورٍ الشقة؟', '', 3),
(62, 5, 'كم ... في الشقة؟', 'غرفةٌ', 'غرفةً', 'غرفٌ', 'غرفًا', '', 1),
(63, 5, 'أين تسكن أنت ؟', 'تسكن في البيت', 'نسكن في البيت', 'يسكن في البيت', 'أسكن في البيت', '', 3),
(64, 7, '\\\"ما نوع الجملة من \\\"أنا طالب في جامعة أم القرى', 'جملة اسمية', 'جملة فعلية', 'جملة حرفية', 'جملة ضمير', '', 0),
(65, 7, 'Bahasa arab dari \\\"di kampus apa kamu belajar?\\\"', 'أين يدرس؟', 'في جامعة ماذا تدرس؟', 'في أي جامعة تدرس؟', 'تدرس أين؟', '', 2),
(66, 7, 'متى تذهب إلى المدرسة؟', 'أذهب الساعةُ السادسةُصباحا', 'أذهب في الساعةُ السادسةُصباحا', 'أذهب الساعةُ السادسةَصباحا', 'أذهب الساعةَ السادسةَصباحا', '', 3),
(67, 7, 'كم يوما تدرس في الأسبوع؟', 'Berapa jam kamu belajar dalam sepekan?', 'Berapa hari kamu belajar dalam sepekan?', 'Berapa pekan kamu belajar dalam sebulan?', 'Berapa hari kamu belajar dalam sebulan?\r\n', '', 1),
(68, 7, 'Arti dari kumpulan kata berikut secara berurutan adalah...\r\nينتهي\r\nحصة\r\nصفّ\r\nيبدأ\r\nينظر\r\n', 'Berhenti, jam pelajaran, kelas, mulai, melihat', 'Berhenti, mata pelajaran, kelas, mulai, menunggu', 'Berhenti, beberapa mata pelajaran, laptop, mulai, menunggu', 'Mulai, papan, laptop, berhenti, menunggu', '', 0),
(69, 7, 'أدرس تسعة أيام في الأسبوع يوم السبت إلى يوم الخميس. أدرس كلية التربية في جامعة دمشقى. أسكن في البيت . البيت بعيد عن الجامعة . أذهب إلى الجامعة بالحافلة\r\nمتى العطلة؟', 'أ. يوم الجمعة\r\n', 'ب. يوم السبت والخميس', 'ج. يوم السبت إلى الجمعة', 'د. يوم الإثنين', '', 0),
(70, 7, 'كم حصة تدرس في اليوم؟', 'أدرس خمسة حصةٍ', 'ب. أدرس خمسة حصصٍ', 'ج. أدرس خمس حصةٍ', 'د. أدرس خمس حصصٍ', '', 3),
(71, 7, 'أدرس في كلية التربية ..... إن شاء الله', 'سأكون معلما', 'ب. سأكون مدرّسٌ', '. ستكون مدرّسٌ', 'ستكون مهندسا\r\n', '', 0),
(74, 11, 'أحمد طالب قديم فس معهد تحفيظ القرآن . <u>هو الآن يتعلّم في الصف الثاني عشر</u>. عنوان المعهد شارع ميلاتي رقم 48 يوغياكارتا. بيت أحمد بعيد عن المعهد. عنوان بيت أحمد شارع بانجاسيلا رقم 12 كوتا غيدي يوغياكارتا. يريد أحمد أن يدرس في جامعة أم القرى بعد هذه المرحلة. \n<br>من طالب قديم في الصّف الثاني عشر من معهد تحفيظ القرآن؟', 'حمدان             ', ' محمد              ', ' حميد                   ', ' أحمد', 'طالب', 3),
(75, 11, 'خبر من الجملة التي تحتها خطّ ', 'هو', 'يتعلّم', 'أحمد', 'في الصف الثاني عشر', 'في تحفيظ القرآن', 1),
(76, 11, 'ضدّ كلمة ”قديم“ هو', 'قادم', 'قدم', 'جديد', 'حديد', 'جيّدٌ', 2),
(77, 11, '...<u>أخو</u> زيد يتعلّم في الصّفّ الثّاني عشر هو يحبُّ دراسة اللغة العربية. الكلمة التي تحتها خطّ هي', 'مبتدأ', 'مضاف إليه', 'خبر شبه الجملة', 'خبر الجملة', 'خبر مقدّم', 0),
(78, 11, 'للمدرسة سكن الطلاب . في السكن يوجد عدد المرافق العامة المختلفة : المسجدان الكبران ,تسعة حجرات النوم, المطعم, المطبخ, المديان, المقصف, المكتبة, و غيرها\r\nكم حجرة في السكن؟', '5 حجرات', '6 حجرات', '7 حجرات', '8 حجرات', '9 حجرات', 4),
(79, 11, 'في المسجد أحمد الطويل, هو طالب جديد. يسكن في سكن الطلاب\r\n...نعت من الجملة السابقة هو', 'في المسجد', 'أحمد', 'هو', 'جديد', 'الطلاب', 3),
(80, 11, 'طالب مجتهد في الفصل\r\n...خبر من الجملة السابقة هو', 'طالب', 'مجتهد', ' في', 'الفصل', 'في الفصل', 4),
(81, 11, 'ب . في السكن يوجد عدد المرافق العامة المختلفة : المسجدان الكبران ,تسعة حجرات النوم, المطعم, المطبخ, المديان, المقصف, المكتبة, و غيرها . \nالإضافة من الجملة السابقة هو', 'أ. للمدرسة    ', 'ب. سكن الطلاب    ', 'ج. المسجدان الكبران     ', 'د. المرافق العامة    ', 'ه. في السكن', 1),
(83, 11, 'انظر إلى الجملة الأتية!\n<br> (1)في الساعة السادسة تماما وصلتُ في موقف الحافلة\n<br>(2) موقف الحافلة مكان كبير و هناك كثير من الحافلة الكبيرة.\n<br>(3) ذهبتُ إلى المدرسة بالحافلة.\n<br>(4) ثمّ جئتُ في المدرسة في الساعة السادسة و النصف.\n<br>(5) ذهبتُ من البيت في الساعة السادسة إلّا خمسة عشر صباحا. \n<br>رتب رقم هذه الجمل لتكون جملة صحيحة', '3-5-1-2-4   ', 'ب. 3-5-1-2-4     ', 'ج. 3-1-5-2-4     ', 'د. 5-4-2-1-3     ', 'ه5.-4-2-3-1', 0),
(84, 11, 'موقف الحافلة مكان كبير و هناك كثير من الحافلة الكبيرة. \nمن الجملة السابقة نعرف أنّ موقف الحافلة', 'أ. ضيّقٌ   ', 'ب. صغير      ', 'ج. كثير   ', 'د. واسع     ', 'ه. قريب', 3),
(85, 11, 'هذه من أقسام الخبر ,إلّا', 'أ. خبر مفرد  ', 'ب. خبر غير مفرد      ', 'ج. خبر الجملة   ', 'د. خبر مرفوع     ', 'ه. خبر شبه الجمل', 3),
(86, 11, 'يعلّمنا الأستاذُ علمَ النحوِ في هذا المعهد . دراسة النحو صَعبٌ جدّا لكن نحبّها\r\n...مبتدأ من الجملة السابقة هو', 'أ. يعلّم    ', 'ب. الأستاذُ     ', 'ج. دراسة     ', 'د. جدّا  ', 'ه. لكن', 2),
(87, 11, 'اللغة العربية من أهمِّ الدراسةِ لأنّها لغة الإسلام و لغة القرآن و لغة حديث رسول الله ﷺ\r\nمضاف إليه من الجملة السابقة هو', 'أ. العربية    ', 'ب.من   ', 'ج. أهمِّ     ', 'د. الإسلام   ', 'ه. لغة', 3),
(88, 11, 'أكمل هذا الحوار!\n<br>أحمد  :انظر إلى حجرات لالطلاب\nُ<br>......................زيد   :الحجرات كبيرة جدَّا\n<br>أحمد :عددُها تسعة حجراتُ', 'أ. متى تذهب إلى الحجرة؟  ', 'ب.هل للمدرسة حجرات؟   ', 'ج. كيف تنام في الحجرة؟     ', 'د. أأنت أحمد؟   ', 'ه. كم عدد الحجرة؟', 4),
(89, 11, 'انظر إلى الحوار!\n<br>والد الطالب : أين تأكلون؟\n<br>الطالب : في هذا المعهد غرفة الأكل. نأكل هناك\n<br>والد الطالب : هل أنتم يطبخون بأنفسكم؟\n<br>الطالب : لا, عندنا طبَّاخون. يطبخون لنا وجبات الفطور و الغداء و العشاء في المطبخ\nّ<br>نعرف من هذا الحوار أن', 'أ.  الطلاب يأكلون في المطبخ  ', 'ب. الطلاب يطبخون الوجبات   ', 'ج. الطلاب يأكلون  في غرفة الأكل  ', 'د. الطلاب يأكلون  في غرفة النوم ', 'ه. الطلاب يصلّون في المسجد', 2),
(90, 11, 'انظر الحوار!\n<br>“الأمّ :“هذا أذان الفجر\n<br>“الأب : “الله أكبر , الله أكبر . أين عمر؟\n<br>“الأمّ : “هو في الحمَّام يتوضّأ\n<br>“الأب : “و أين رقيّة؟\n<br>“الأمّ : “هي في المصلّى تُصلّي\n<br>من في الحمّام يتوَضَّأ؟', 'أ. الأب      ', 'ب. الأمّ    ', 'ج. عمر   ', 'د. رقيّة   ', 'ه. كلّ الإجابة خطأ', 2),
(91, 11, 'انظر إلى مخطّطة الأسرة\r\n...العبارة المناسبة هي', 'أ. أبو خديجة عبد الله  ', 'ب. سعيدة أمّ عبد الله    ', 'ج. رقية زوجة صالح', 'د. عمّار و خولة طفلا زينب و خالد', 'ه. زينب أمّ عمّار', 4),
(92, 11, 'نحن ندرس في المعهد و نسكن في سكن الطلاب. عند يوم الجمعة نعمل هواياتِنا. هذا أحمد هو يحبُّ قراءة الكتب و الجرائد. عنده كتب و هو يشتري كتابا واحدا في كلّ شهر. وهذا عبد الرحمان هو يحبّ الرياضة. يحبّ السِّباحة و الفروسيّة حُبّا شديدا. و أنا سعيدٌ هواياتي قراءة كُتُب الإسلامية و السفرُ و الطبخُ.\r\nالموضوع المناسب للحوار السابق هو', 'أ. هوايات الطلاب    ', 'ب. هوايات أحمد      ', 'ج. هوايات سعيد         ', 'د. هواياتي   ', 'ه. سكن الطلاب', 0),
(93, 11, '“مدرِّس النّحو جاء في الفصل . الكتابة الصحيحة من كلمة “النّحو', 'أ. النّحوُ ', 'ب. النّحوَ   ', ' ج. النّحوِ ', 'د. النّحوْ ', 'ه. نحوًا', 2),
(94, 11, 'سليمان له هوايات كثيرة, منها القراءة والمراسلة و كرة القدم وتنس الطاولة وكرة السلة والكرة والطائرة والتصوير والصحافة.\r\nيقرأ سليمان في أوقات الفراغ الكتب الدنية والمجلات والجريدة. يشتري سليمان كتابا جديدا كلّ شهر ,وهو الآن يملك مكتبة كبيرة في البيت ,وهو ينظّم لكتب على الرفوف\r\n...من هواية سليمن هي', 'أ. القراءة ', 'ب. السّباحة    ', 'ج. الرحلة ', 'د. الفروسية ', 'ه. الطّبيعة', 0),
(95, 11, 'يقرأ سليمان ........ الجديد', 'أ. الكِتَابَ  ', 'ب. الكِتَابِ   ', 'ج. كتبًا ', 'د. كتبٍ  ', 'ه. قِرَاءَة', 0),
(96, 11, 'انظر إلى الحوار!\nأحمد : “أنا مدرِّس . ما مهنتك؟“\nزيد : “أنا طبيب . في أيِّ مرحلة تدرّس؟“\nأحمد : “أدرّس في المرحلة الإبتدائية. هل تعمل في المستشفى؟“\nزيد : “نعم , أعمل في المستشفيات“\nاسم الفاعل من الحوار السابق', 'أ. أنا ', 'ب. أدرّس    ', 'ج. مرحلة  ', 'د. المستشفى ', 'ه. مدرّس', 4),
(97, 11, '...نعرف من الحوار السابق أنّ', 'أ. أحمد يدرّس في المرحلة المتوسطة', ' ب. أحمد يعلّم في المرحلة الإبتداءية', ' ج. أحمد يعمل في الستشفى الواحدة', ' د. زيد يعمل في الستشفى الواحدة', 'ه. زيد يعمل في المدرسة', 1),
(98, 11, '...الجُمَلُ الآتيات جُمَلٌ خطيئة, إلَّا', 'أبِي تَاجِرٌ مُجْتَهِدٌ يَبِيْعُ المَلَابِسِ في السُّوْقِ', ' ب. أبِي تَاجِرٌ مُجْتَهِدٌ يَبِيْعُ مَلَابِسَ في السُّوْقُ', ' ج. أبِي تَاجِرٍ المُجْتَهِدِ يَبِيْعُ المَلَابِسَ في السُّوْقِ', ' د. أبِي تَاجِرٌ المُجْتَهِدِ يَبِيْعُ المَلَابِسَ في السُّوْقِ', 'ه. أبِي تَاجِرٌ مُجْتَهِدٌ يَبِيْعُ مَلَابِسَ في السُّوْق', 4),
(99, 11, 'عالج الطبيبُ المريضَ في غرفة الفحص. \n<br>مفعول به في الجملة السابقة', 'أ. عالج  ', 'ب. البيبُ   ', 'ج. المريضَ ', 'د. في ', 'ه. غرفة الفحص', 2),
(100, 11, '!انظر إلى الحوار\n<br>زيد : أنت مدرِّس و أنت تدرِّس الأطفالَ في المدرسة؟ هل تحبّ عملَك؟\n<br>أحمد : نعم, و أحِبُّ عملي . أدرِّس رغبةً في العلم\n<br>مفعول لأجله في الجملة السابقة', 'أ. مدرِّس  ', 'ب. مدرِّس  ', 'ج. عملَك ', 'د.رغبةً  ', 'ه. العلم', 3),
(101, 11, '...حرف الواو التي تضع قبل مفعول معه هي', 'أ. واو المعية  ', 'ب. واو العطف  ', 'ج. واو الحال ', 'د.واو الإستئنافية  ', 'ه. كلّ اللإجابة خطأ', 0),
(102, 11, 'عليٌ مهندس يعمل في الشركة. يعمل ثماني ساعات في اليوم\r\nكم ساعة يعمل علي في اليوم؟', 'أ. سبع ساعات  ', 'ب. ثماني ساعات ', 'ج. عشر ساعات ', 'د. إحدى عشرة ساعات', 'ه. ثانية عشرة ساعات', 1),
(103, 11, '...بكى الولد <u>خوفا</u> من الكلب.  ِمعنى الكلمة التي تحتها خطّ', 'Sangat takutأ. ', 'Tidak takutب. ', 'Sedang takutج. ', 'Bersama ketakutanد. ', 'Karena takutه.', 4),
(104, 11, ' أستيقظ من النوم ... أذان الفجر ثمّ أتوَضّأ و أغتسل  وأصّلي صلاة الفجر   ', 'أ. قبل ', 'ب. أمام ', 'ج. خلف  ', 'د. تحت  ', 'ه. مساء', 0),
(105, 11, 'أبي ... المعهد في المرحلة الإبتدائية', 'أ. طالبة       ', 'ب. طبيب    ', 'ج. طالب    ', 'د. مدرّس      ', 'ه. تاجر', 3),
(106, 11, '!انظر إلى الجمل\n<br>(1)هذا أخي هو مهندس\n<br>(2). يأكل الطعامَ أكلاً كثيرٍ\n<br>(3). هل أنتِ طالبة؟\n<br>(4). هذه أختي هي مهندس.\n<br>الجملة الخطيئة من الجمل السابقة هي', '1,3  أ     ', 'ب.2.4    ', 'ج. 3,4     ', 'د. 2,3      ', 'ه. 1,4', 1),
(107, 11, 'يجب على المراهقين والمراهقات أن يملكوا امالا رفيعة في مستقبل حياتهم. علي يريد أن يكون طبيبا وزينب تريد أن تكون مهندسة وعمريريد أن يكون طيارا ومنهم من يريد أن يكون وزيرا والخ\r\nأداة النصب في الجملة السابقة هي', 'أ. على      ', 'ب.أن يملكوا    ', 'ج. أن  ', 'د. في      ', 'ه. يملكوا', 2),
(108, 11, '!اختر الجملة التي فيها فعل مضارع للمجهول', 'أ. يَأمُرُ الإسلمُ بالنظافة', ' ب كَنَسَ البناتُ   ', 'ج. يُؤمَرُ المسلمون بوقاية النظافة    ', 'د. أمَرَ الإسلامُ بالنظافة', 'ه. يَكنُس البناتُ غرقة النوم', 2),
(109, 11, 'النَّظافَةُ نَوعانِ : نَظافَةٌ خاصَّةٌ ،وَنَظافَةٌ عامَّةٌ . فالنَّظافَةُ الخاصَّةُ نظافَةُ جِسْمِ الإنْسانِ وَثَوبِهِ وَطعامِهِ وَبَيتِهِ. أَمّا النَّظافَةُ العامَّةُ ، فَنَظافَةُ الأَماكِنِ العامَّةِ ،كَالشَّوارِعِ وَ الحَدائِقِ .وَتَقَعُ مَسؤولِيَّةُ النَّظافَةِ الْخاصَّةِ عَلَى الأَفْرادِ .أَمّا مَسؤولِيَّةُ النَّظافَةِ العامَّةِ ، فَتَقَعُ عَلَى الأفْرادِ وَ الحُكوماتِ. يُقاسُ تَقَدُّمُ الدُّوَلِ بِالنَّظافَةَ ، فِإذا كانَتِ الدَّوْلَةُ وَسُكَّانُها يَهْتَمونَ بِالنَّظافَةِ ، فَهِيَ دَوْلَةٌ مُتَحَضِّرَةٌ ، وَإِذا كانَتِ الدَّوْلَةُ وسُكّانُها لا يَهْتَمّونَ بِالنَّظافَةِ ،فَهِيَ دَوْلَةٌ مُتَخَلِّفَةُ .وَهُناكَ دُوَلٌ مَشْهورِةٌ في الْعالَمِ بِالنَّظافَةِ ، وَهِيَ قَليلَةٌ مِثْلُ ماليزِيا وَسِنْغافورَة. وَهُناك دُوَلٌ مَشهورِةٌ بِالقَذارَةِ ، وَهِيَ كَثيرَةٌ .\r\n....الفقرة الرئيسة من النص السابق هي', 'أ. التسوق      ', 'ب الرّياضة  ', 'ج. الصِّحة   ', 'د. الهواية      ', 'ه. النظافة', 4),
(110, 11, '...إنَّ المراهق متفائل. إعراب كلمة “المراهق“ هو', 'أ. مبتدأ      ', 'ب خبر   ', 'ج. اسم إنّ     ', 'د. خبر إنّ      ', 'ه. فاعل', 2),
(111, 11, '...العلم كالنور في الهداية . الجملة السابقة تدلّ على', 'أ. إنشاء     ', 'ب كناية   ', 'ج. تشبيه     ', 'د. مجاز مرسل      ', 'ه. مجاز مركب', 2),
(112, 11, 'املإ الفراغ\n<br>مريم : السلام عليكم يا ندى\n<br>ندى : وعليكم السلام يا مريم\n<br>مريم : لماذا ذهبتِ إلى ... بالأمس؟\n<br>ندى : قابلتُ الطبيبَ\n<br>مريم : هل أنتِ مريضة؟\n<br>ندى : نعم , شعرتُ بألم شديد في بطني\n<br>مريم : و بِمَ نصحكِ الطبيب؟\n<br>ندى : كان ... نصحني بالراحة و تناول الدّواء\n<br>الكلمة المناسبة هي', 'أ. المسجد , الطبيبَ     ', 'ب. المسجد , الطبيبُ', 'ج المسجد  , الطبيبِ   ', 'د. المستشفى , الطبيبُ   ', 'ه. المستشفى , , الطبيب', 3),
(113, 11, 'من قال لندى أنْ تكون بالراحة و تناول الدواء؟', 'أ. ندى     ', 'ب مريم   ', 'ج. المريضة  ', 'د. الطبيب   ', 'ه. الممرّضة', 3),
(114, 11, 'املإ الفراغ بكلمة مناسبة!\r\n عليك أن تُمَارسَ الرِّيَاضَةَ البَدَنِيَّةَ، مِثْل الجَرْيِ والسِبَاحَة وَلَعْبِ الكُرَة , و لا .... أن ...... أيضًا رياضة النفس كقراءة القرآن وتلاوة الأذكار', 'أ. ننسيا , نمارسَ', 'ب. ننس , نمارسَ', 'ج. ننسى , نمارسُ', 'د. تنس , تمارسَ', 'ه. تنسي , تمارسَ', 3),
(115, 8, '... الجملة المناسبة لهذه الصورة ', 'أ. أذهب إلى المكتبة عند الإستراحة', 'ب. أتناول الفطور في المقصف', 'ج. نلعب كرة القدم في الملعب', 'د. يستمع الطلاب خطبة المدير في قاعة الإجتماعيات', 'ه. أمرنا الأستاذ أن نذهب إلى المعمل في حصة الفيزياء', 4),
(116, 8, 'الجملة المناسبة لهذه الصورة', 'أ. كم حجرة في السكن؟\r\n', 'ب. يصلي الطلاب في المسجد\r\n', 'ج. هل ذهبت إلى المكتبة؟\r\n', 'د. الطلاب يأكلون في غرفة الأكل\r\n', 'ه.المدير في غرفة الإستقبال يستقبل الضيوف\r\n', 0),
(117, 8, 'الجملة المناسبة لهذه الصورة', 'أ. هل تزوّد كل حجرة بالحاسوب؟\r\n', 'ب. أرتب الملابس في الخزانة\r\n', 'ج. يتكلم أحمد مع صديقه في المحمول\r\n', 'د. ينام خالد على السرير\r\n', 'ه.أغسل الملابس في الحمام\r\n', 0),
(118, 8, 'الجملة المناسبة لهذه الصورة', 'أ. أتناول الفطور الساعة السابعة ونصف صباحا\r\n', 'ب. أتناول الفطور الساعة السابعة ونصف ليلا\r\n', 'ج.   أتناول العشاء الساعة السبعة ونصف صباحا\r\n', 'د.  آكل العشاء  الساعة السابعة ونصف ليلا\r\n', 'ه. آكل العشاء  الساعة السبعة ونصف ليلا\r\n', 3),
(119, 8, 'أين يغسل الأب وأحمد ؟', 'أ. هم يغسل في الحمام\r\n', 'ب.هي تغسل في الحمام\r\n', 'ج.  هما يغسلان في الحمام\r\n', 'د.  تغسلان في الحمام\r\n', 'ه. يغسلون في الحمام\r\n', 2),
(120, 8, 'رتب الكلمات!', 'أ. هو طالب هذا أخي الثانوية الإسلامية من طلاب المدرسة', 'ب. هو طالب من طلاب المدرسة الثانوية الإسلامية هذا أخي', 'ج. هو طالب الثانوية الإسلامية هذا أخي من طلاب المدرسة', 'د. هذا أخي من طلاب المدرسة الثانوية الإسلامية هو طالب', 'ه. هذا أخي هو طالب من طلاب المدرسة الثانوية الإسلامية', 4),
(121, 8, 'في ما يلي جملة صحيحة إلا', 'أ. أصلي الصبح في البيتِ جماعةً', 'ب. نشاهد الترفيزيونَ في غرفةِ الجلوسِ', 'ج. يقرأ أبي المجلة في غرفةَ الجلوس', 'د. نقرأ القرآنَ بعد صلاة العشاء', 'ه. أعمل الواجبَ المنزليَ بعد صلاةِ المغربِ', 2),
(122, 8, 'عائشة ... أمها على إعداء الطعام', 'أ. تستريح', 'ب. تدرس', 'ج. تقرأ', 'د. تساعد', 'ه. تنام', 3),
(123, 8, 'سليمان وأسرته يجتمعون و... في غرفة الجلوس', 'أ. يطبخ', 'ب. يشاهد', 'ج. يسترحون', 'د. يساعدون', 'ه. يقومون', 2),
(124, 8, '... أين ينامون؟ هم ينامون ', 'أ. في غرفة الجلوس', 'ب. في غرفة المذاكرة', 'ج. في غرفة النوم', 'د. في غرفة البيت', 'ه. في الملعب', 2),
(125, 8, 'من النوم في الساعة الرابعة قبل الصبح ...', 'أ. تغسل', 'ب. تستيقظ', 'ج. نساعد', 'د. ننظم', 'ه. مسافر', 1),
(126, 8, '  أخي الصغير ... الملابس في الحمام', 'أ. يقوم', 'ب. يتعلم', 'ج. يصلي', 'د. يلعب', 'ه. يغسل', 4),
(128, 8, '...في بيتي طابقين . في الطابق العلوي غرف النوم وغرفة الأسرة . وفي <u>الطابق السفلي</u> غرفة الجلوس \nوغرفة الأكل.\nالترجمة من الكلمة التي تحتها خط هي', 'أ. Piring', 'ب. Kamar', 'ج. Lantai atas', 'د. Lantai bawah', 'ه. Lantai', 3),
(129, 8, '... أمي <u>تساعد</u> أخي الصغير في مذاكرة الدروس.\nمعنى كلمة تحتها خط', 'أ. Melihat', 'ب. Membantu', 'ج. Menilai', 'د. Mengerjakan', 'ه. Mencuci', 1),
(130, 8, '...عند سليمان هوايات <u>كثيرة</u>.\nإعراب كلمة تحتها خط هو', 'أ. مبتدأ', 'ب. خير', 'ج. نعت', 'د. مضاف إليه', 'ه. مفعول به', 2),
(131, 8, '... وفي أوقات الفراغ يلعب سليمان <u>كرة</u> القدم.\nإعراب كلمة تحتها خط هو', 'أ. مبتدأ', 'ب. خير', 'ج. نعت', 'د. مضاف إليه', 'ه. مفعول به', 4),
(132, 8, '...وهو <u>ينظم</u> الكتب على الرفوف.\nإعراب كلمة تحتها خط هو', 'أ. مبتدأ', 'ب. خير', 'ج. نعت', 'د. مضاف إليه', 'ه. مفعول به', 1),
(133, 8, '...وهو <u>ينظم</u> الكتب على الرفوف.\nمعنى كلمة تحتها خط', 'أ. Membeli', 'ب. Memiliki', 'ج. Menyusun', 'د. Mengambil', 'ه. Membaca', 2),
(134, 8, ' “اشتريتُ كتابا جديدا في اللشهر. ضد كلمة ”اشتريتُ', 'أ. بعت', 'ب. اشتريتُ', 'ج. نظّمت', 'د. احتويت', 'ه. كنت', 0),
(135, 8, 'هم يبحث الأخبار . ما مهنتهم؟', 'أ. السائق', 'ب. البائع', 'ج. الزبالة', 'د. الفلاح', 'ه. الصحفي', 4),
(136, 8, 'العبارة المناسبة هي', 'أ. المهنة متنوعة', 'ب. يعمل الفلاح في السوق', 'ج. يبيع التجار يوم الأحد فقط', 'د. يكتب الصحفيون المجلات', 'ه. لا يوجد جواب صحيح', 0),
(137, 8, 'العبارة المناسبة هي', 'أ. المهنة متنوعة', 'ب. يعمل الفلاح في السوق', 'ج. يبيع التجار يوم الأحد فقط', 'د. يكتب الصحفيون المجلات', 'ه. لا يوجد جواب صحيح', 0),
(138, 8, 'الشرطي ... المرور', 'أ. ينظم', 'ب. يسوق', 'ج. يوفر', 'د. يكنس', 'ه. يزرع', 0),
(139, 8, '...أبي يذهب إلى السوق كل يوم. هو', 'أ. طبيب', 'ب. تاجر', 'ج. فلاح', 'د. ممرض', 'ه. صحفي', 1),
(140, 8, '...أحب السباحة سأذهب إل المعرض في جناح', 'أ. خطوط العربي', 'ب. الرياضة', 'ج. التعبير المنزلي', 'د. الطوابع', 'ه. الرسم', 1),
(141, 8, ' يكنس الشارع...', 'أ. الطبيب', 'ب. الشرطي', 'ج. الممرضة', 'د. الكناس', 'ه. الصحفي', 3),
(142, 8, 'الصحفي ... المقابلة مع الوزير', 'أ. يجري', 'ب. يكتب', 'ج. ينظم', 'د. يكنس', 'ه. يساعد', 1),
(143, 8, 'أي جمعية تخترين؟', 'أ. أختار جمعية العلوم', 'ب. أختار جمعية القراءة', 'ج. أختار جمعية الرسم', 'د.  أختار جمعية التدبير المنزلي', 'ه. أختار جمعية الحاسوب', 4),
(144, 8, 'المدرس : ما هوايتك يا عبد الله؟\r\nعبد الله : هوايتي ... ، عندي جناح خاص للرسم وهذه رسومات', 'أ. القراءة', 'ب. الرسم', 'ج. الرياضة', 'د. التدبير المنزلي', 'ه. الرحلات', 1),
(145, 8, ' المعلم : ما مهنة أبيك يا حسين؟\r\nحسين : أبي فلاح . هو ... الأرز والذرة في المزارع', 'أ. يكنس', 'ب. ينظم', 'ج. يبيع', 'د. يعالج', 'ه. يزرع', 4),
(146, 8, '...الله لا يهدي القوم الظالمين.\nالمفعول به من الصورة السابقة ', 'أ. الله', 'ب. يهدي', 'ج. القوم', 'د. الظالمين', 'ه. لا', 2),
(147, 8, '...العبارة المناسبة من الفقرة السابقة هي', 'أ. ينبغي لنا أن نأكل كثيرا', 'ب. ننال الصحة بممارسة عمل طيب', 'ج. لا نمارس الرياضة لأنها تجعلنا التعب', 'د. كل الغداء طيب', 'ه. الصحة صعبة', 1),
(148, 8, '...الفقرة الرئيسة من النص السابق', 'أ.مهنة الطلاب', 'ب. اهتمام الرياضة', 'ج. الصحة مهمة', 'د. جناح المعرض', 'ه. النظافة', 1),
(149, 8, 'أحب أن ... جندا شجاع', 'أ.أكون\r\n', 'ب. أختار\r\n', 'ج. تكون\r\n', 'د.أجعل\r\n', 'ه. تختار\r\n', 0),
(150, 8, 'المدرسة تريد أن ... علينا بعض الدروس', 'يقرأَ\r\n', 'ب. تقرأَ\r\n', 'ج. تقرئين\r\n', 'د. نقرأَ\r\n', 'ه. نقرأُ\r\n', 1),
(151, 8, '!رتب\r\nحميدة- دروسها- أن-تريد-في-تذاكر-المكتبة\r\n', 'أ. تريد حميدة أن تذاكر دروسها في المكتبة\r\n', 'ب. تذاكر حميدة أن تريد دروسها في المكتبة\r\n', 'ج. حميدة تريد أن دروسها تذاكر في المكتبة\r\n', 'د. حميدة تذاكر أن تريد في المكتبة دروسها\r\n', 'ه. تذاكر حميدة دروسها أن تريد في المكتبة\r\n', 0),
(152, 8, 'يجب على الطلاب أن ينظم حياتهم\r\n ...ترجم الجملة السابقة\r\n', 'أ. Para siswa harus mengatur hidup mereka\r\n', 'ب. Para siswa mungkin untuk membagi waktu antara bekerja dan istirahat\r\n', 'ج. Para siswa lebih senang menjadi wartawan di kehidupan mereka\r\n', 'د. Para siswa ingin menghafal pelajaran selama hidupnya\r\n', 'ه. Para siswa wajib membersihkan hidup mereka\r\n', 0),
(153, 8, 'الرجل ... السيارةُ في الشارع', 'أ. تعلمه\r\n', 'ب. فكّره\r\n', 'ج. قسّمه\r\n', 'د. صدمته\r\n', 'ه. مارسته\r\n', 3),
(154, 8, '....كان المراهقون متفائلين لا \n \n', '\r\nأ. تتكاسل ', 'ب. تتكاسلي\r\n', 'ج. تتكاسلوا\r\n', 'د. تكاسل\r\n', 'ه. تتكاسلون', 2),
(155, 8, 'عندي صداع ، عندي ألم في...\r\n', 'أ. القلب\r\n', 'ب. المعدة\r\n', 'ج. اليد\r\n', 'د. الرأس\r\n', 'ه. إصبع\r\n', 3),
(156, 8, 'مرض علي ف...بعض الأدوية في الصيدلة', 'أ. ليشتر', 'ب. ليشرب', 'ج. ليتناول', 'د. ليقسّمه', 'ه. ليحقّق', 0),
(157, 8, 'يشتري أحمد الدواء في...من بيته', 'أ. صيدلية قريبة', 'ب. الصيدلية قريبة', 'ج.صيدلية قريب', 'د. الصيدلية قريب', 'ه. صيدلية القريبة', 0),
(158, 8, 'المسلمون...يعملون الصالحات', 'أ. الصالح', 'ب. الصالحون', 'ج. الصالحة', 'د. يصلحون', 'ه. الصالحا', 1),
(159, 8, 'أتناول الفيتامينات\r\nغيّر الفعل إل مبني للمجهول!', 'أ. أُتَنَاوَلُ', 'ب. تُتَنَاوَلُ', 'ج. يُتَنَاوِلُ', 'د. تُتَنَاوِلُ', 'ه.تُتُنَاوَلُ', 1),
(160, 8, 'أنعم الله الناس نعمًا كثيرةً\r\nغيّر الفعل إل مبني للمجهول!', 'أ. أَنعَمَ', 'ب. أُنعَمَ', 'ج. أُنعُمَ', 'د. أَنعِمَ', 'ه. أُنعِمَ', 4),
(161, 8, '...ينبغي لكل المراهق أن <u>يمارسوا</u> الرياضة!\nترجم كلمة تحتها خط', 'أ. Dia melaksanakan', 'ب. Mereka melaksanakan', 'ج. Dia membiasakan', 'د. Mereka membiasakan', 'ه. Dia mencakup', 3),
(162, 8, '...الراحة الكافية <u>ضرورية</u>\nترجمة كلمة تختها خط', 'أ. Bahaya', 'ب. Gawat', 'ج. Cukup', 'د. Istirahat', 'ه. Penting', 4),
(163, 8, 'قال رسول الله صلى الله عليه وسلم :“يا بلال أرحنا بالصلاةُ“\nمفعول به من الحديث السابق...', 'أ. يا', 'ب. بلال', 'ج. أرح', 'د. ضمير نحن', 'ه. بالصلاة', 3),
(164, 8, ' أجب السؤال ممستعينا بالصورة!\nالمواد الضرورية مثل البورتينات و....', 'أ. الحبات', 'ب. الغداء', 'ج. اللبن', 'د. الماء', 'ه. الفيتايمنات', 4),
(165, 8, 'يكون ... أهم راحة للإنسان', 'أ. الكسل', 'ب. راحة كافية', 'ج. راحة كثيرة', 'د. راحة قليلة', 'ه. مات', 1);

-- --------------------------------------------------------

--
-- Table structure for table `ujian`
--

CREATE TABLE `ujian` (
  `id` int NOT NULL,
  `mapel` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `tanggal` date NOT NULL,
  `waktu` int NOT NULL,
  `jumlah_soal` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `ujian`
--

INSERT INTO `ujian` (`id`, `mapel`, `tanggal`, `waktu`, `jumlah_soal`) VALUES
(1, 'الوحدة الأولى', '2025-12-31', 45, 10),
(2, 'الوحدة الثانية', '2025-12-31', 0, 0),
(3, 'الوحدة الثالثة', '2025-12-31', 0, 0),
(4, 'الوحدة الرابعة', '2025-12-31', 0, 0),
(5, 'الوحدة الخامسة', '2025-12-31', 0, 0),
(6, 'الوحدة السادسة', '2025-12-31', 0, 0),
(7, 'الوحدة السابعة', '2025-12-31', 0, 0),
(8, 'Latihan USP Bahasa Arab 2025', '2025-04-06', 90, 50),
(9, 'الاستماع الأول', '2025-12-31', 0, 0),
(10, 'الاستماع الثاني', '2025-12-31', 0, 0),
(11, 'USP Bahasa Arab 2024', '2025-04-06', 90, 40);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `nama` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `no_wa` varchar(20) COLLATE utf8mb4_general_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `tahun` varchar(4) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `nama`, `no_wa`, `password`, `tahun`) VALUES
(1, 'Admin', '085640332823', '$2y$10$lLb/EZG64cy1XtyAp0eTpOXJKj.rlCQOPyS6.MHHxUwBcu2h9Q3me', '2024'),
(2, 'Coba', '01', '$2y$10$u5bqKHyhZTG6ptLjdgvDEO3ThlRZV2xJICKfopbKob32XbHFmw/zm', '2025'),
(3, 'ABIDAH LAILA ZAHIDAH', '', '', ''),
(4, 'ALIFA NUR \'AZAZA', '', '$2y$10$Fh/Z8R1LzkYxdDEzMXH7XeKC.kL.o21WIc2CKqQyq7oQlBIUotdmu', '2025'),
(5, 'ALIYA LULU ILMA', '', '', '2025'),
(6, 'ALKHANSA MINNAHUSSANIYYAH', '', '$2y$10$OYVl7J5P8GdVy7xKFQrn4OrQJLoXdDRs4X/F8gWpnsGoJTsaEvNK2', '2025'),
(7, 'ARDANTI AZAHRA SALSABILLA', '', '$2y$10$ywl1YXKc0VluBZzWSGKtwOYljwJZR6UDKQrrymtmJSPm3McPG/DJ2', '2025'),
(8, 'DAFFA\' NADA AZIZAH', '', '$2y$10$5vb48NOWDBGuiMFJGZ980e0vWJJWLLmS9brTHSUAkRLsDreAkQHJy', '2025'),
(9, 'FATIN FAUZIYAH NUR HASANAH', '', '', ''),
(10, 'FITRIA SALMA TRI NOVIYATI', '', '', ''),
(11, 'HADANA ULUFA NUR RAMADHANI', '', '', ''),
(12, 'HANUN NAYLATUSY SYAROFAH', '', '', ''),
(13, 'NAFISA ANGGI CELOMITHA', '', '$2y$10$mrtV6hCB7VOpNS1oDAPx0uPSjYJ2uI/glbumvvvc.eZDqISMF36HC', '2025'),
(14, 'NASYWA FAWWAZIYAH', '', '$2y$10$hcBAECVcAi41SUn7Do8uPunPdNN.i5vPyHAGo1JeVO4sI6euXGaUe', '2025'),
(15, 'SALMA NABILA', '', '', '2025'),
(16, 'SHOFI NUR IZZATI', '', '$2y$10$cjroOtFyiMK35QVJPHfRL.4oAgR5kfnQfN.zTT3vuDyCVPTwpwyfK', '2025'),
(17, 'SYIFA AZZAHRA PUTRI', '', '$2y$10$ouKrj.p8euBS9rflr6eOdeqci9Z4GiBTS0.X.SfUWe/ZxyWmOoCFu', '2025'),
(18, 'TSABITAH SAKHA ARIFIN', '', '', ''),
(19, 'YESSICA ANGGRAENI Z', '', '', ''),
(20, 'YUNIFA NELLA KHOIRUNNISA', '', '$2y$10$2GDuU3LPPjV2.Y5T.uE72eKObSGw7FPbavo26Z5l3eWYmGNA9vATu', '2025'),
(21, 'HAMMIDA PUTRI RAHMAWATI', '', '', ''),
(22, 'KAYYISA', '', '$2y$10$K8UOV9qcOYosa4COfZ0GFerkZMH.plapN2RA3X9MBIe/FGCUbZPUW', '2025'),
(23, 'QOLBIATUSSHANI SYALWA MASHURI', '', '$2y$10$SpOTuYPcaIPKF/0z3aJUoO/jAMMpJJwsb4dh8GhKYfKKfWSuBmyMC', '2025');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `nilai`
--
ALTER TABLE `nilai`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `soal`
--
ALTER TABLE `soal`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ujian`
--
ALTER TABLE `ujian`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `nilai`
--
ALTER TABLE `nilai`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- AUTO_INCREMENT for table `soal`
--
ALTER TABLE `soal`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=167;

--
-- AUTO_INCREMENT for table `ujian`
--
ALTER TABLE `ujian`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
